In [6]:
import cassandra
print (cassandra.__version__)

3.25.0

In [31]:
#connection established 
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': 'G:\secure-connect-test2.zip'
}
auth_provider = PlainTextAuthProvider('HGuMxkIqmLAlZjBKDFCGXRBY', 'rgy.7rn,XkJgtZABtXCN6dTrtIPKZr,PeInjzjvj,xHNpm-aYjEwX0i1,FmE7cEqkeMEQXxX9Z+F1k3i28Wi-9g-Q4l173j26DbYA-EfcUiGYL4QxOdk_TdFUaH7cxii')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select * from system_schema.keyspaces").one()
print(row)

Row(keyspace_name='database1', durable_writes=True, graph_engine=None, replication=OrderedMapSerializedKey([('class', 'org.apache.cassandra.locator.NetworkTopologyStrategy'), ('us-east1', '3')]))

In [42]:
#crete table 
row1=session.execute("CREATE TABLE database1.emp1(id int PRIMARY  KEY, lastname text , firstname text );").one()
print(row1)

None

In [45]:
#insert the singel record 
row = session.execute("INSERT INTO database1.emp1(id, lastname, firstname) VALUES (25, 'sudhansu','kumar');")
print(row)

<cassandra.cluster.ResultSet object at 0x000000C080813EB0>

In [51]:
#select the record
row = session.execute("select * from database1.emp1 ")
for i in row:
    print(i[0::])

(25, 'kumar', 'sudhansu')

In [ ]:
#inert into multiple record 
row = session.execute("INSERT INTO database1.emp1(id, lastname, firstname) VALUES (25, 'sudhansu','kumar');")
print(row)

In [75]:
#add_cloumns in exsiting table
row=session.execute("ALTER TABLE database1.emp1 ADD emp_email2 text")
print(row)

<cassandra.cluster.ResultSet object at 0x000000C081422100>

In [76]:

row1=session.execute(("select * from database1.emp1"))
for j in row1:
    print(j[0:])

(25, None, None, 'kumar', 'sudhansu')

In [77]:
#drop in exsiting table
row1=session.execute("ALTER TABLE database1.emp1 DROP emp_email")
print(row1)

<cassandra.cluster.ResultSet object at 0x000000C0FDD29AF0>

In [79]:
#check the existing table is deleted
row1=session.execute("select * from database1.emp1")
for i in row1:
    print(i[0:])

(25, None, 'kumar', 'sudhansu')

In [102]:
row3=session.execute("create table database1.emp3(emp_id int PRIMARY KEY , emp_city text, emp_name text, emp_phone varint , emp_sal int );").one()
print(row3)

None

In [103]:
#you can execute multiple modification statements (insert, update, delete) simultaneiously.
row1=session.execute("BEGIN BATCH INSERT INTO database1.emp3 (emp_id, emp_city, emp_name, emp_phone, emp_sal) values( 4,'Pune','rajeev',9848022331, 30000);UPDATE database1.emp3 SET emp_sal = 50000 WHERE emp_id =3; DELETE emp_city FROM database1.emp3 WHERE emp_id = 2;APPLY BATCH;")

In [107]:
#insert,update,delete simultaneiousley
for i in session.execute("select * from database1.emp3"):
    print(i[0:])

(4, 'Pune', 'rajeev', 9848022331, 30000)
(3, None, None, None, 50000)

In [114]:
#insert multiple statment using batch statment
session.execute("CREATE TABLE database1.emp_data(E_id int PRIMARY KEY,Name text,emp_start_date date, emp_end_date date,);")

In [129]:
query=session.execute("""BEGIN BATCH 
                      INSERT INTO database1.emp_data(E_id, Name, emp_start_date, emp_end_date) VALUES(1006, 'Rana', '2019-12-05','2020-11-28'); 
                      INSERT INTO database1.emp_data(E_id, Name) VALUES (1005, 'satish');
                      INSERT INTO database1.emp_data(E_id, Name,emp_start_date) VALUES (1007, 'sanagmesh', '2021-05-06');APPLY BATCH;""")
print(query)

<cassandra.cluster.ResultSet object at 0x000000C081256850>

In [133]:
for i in session.execute("select * from database1.emp_data"):
    print(f"{i[0]},{i[1]},{i[2]},{i[3]}")

1006,2020-11-28,2019-12-05,Rana
1007,None,2021-05-06,sanagmesh
1005,None,None,satish

In [149]:
#update values 
session.execute("update database1.emp_data set emp_start_date='2020-04-21', emp_end_date='2021-06-25' where E_id=1005 ")
print('updated')

updated

In [150]:
for i in session.execute("select * from database1.emp_data"):
    print(f"{i[0]},{i[1]},{i[2]},{i[3]}")

1006,2020-11-28,2019-12-05,Rana
1007,None,2021-05-06,sanagmesh
1005,2021-06-25,2020-04-21,satish

In [153]:
#delete satament
session.execute(" delete from  database1.emp_data WHERE E_id=1007")
print('deleted')

deleted

In [154]:
for i in session.execute("select * from database1.emp_data"):
    print(f"{i[0]},{i[1]},{i[2]},{i[3]}")

1006,2020-11-28,2019-12-05,Rana
1005,2021-06-25,2020-04-21,satish